; ModuleID = 'main.bc'
source_filename = "main.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%"class.std::ios_base::Init" = type { i8 }
%"class.std::basic_ostream" = type { i32 (...)**, %"class.std::basic_ios" }
%"class.std::basic_ios" = type { %"class.std::ios_base", %"class.std::basic_ostream"*, i8, i8, %"class.std::basic_streambuf"*, %"class.std::ctype"*, %"class.std::num_put"*, %"class.std::num_get"* }
%"class.std::ios_base" = type { i32 (...)**, i64, i64, i32, i32, i32, %"struct.std::ios_base::_Callback_list"*, %"struct.std::ios_base::_Words", [8 x %"struct.std::ios_base::_Words"], i32, %"struct.std::ios_base::_Words"*, %"class.std::locale" }
%"struct.std::ios_base::_Callback_list" = type { %"struct.std::ios_base::_Callback_list"*, void (i32, %"class.std::ios_base"*, i32)*, i32, i32 }
%"struct.std::ios_base::_Words" = type { i8*, i64 }
%"class.std::locale" = type { %"class.std::locale::_Impl"* }
%"class.std::locale::_Impl" = type { i32, %"class.std::locale::facet"**, i64, %"class.std::locale::facet"**, i8** }
%"class.std::locale::facet" = type <{ i32 (...)**, i32, [4 x i8] }>
%"class.std::basic_streambuf" = type { i32 (...)**, i8*, i8*, i8*, i8*, i8*, i8*, %"class.std::locale" }
%"class.std::ctype" = type <{ %"class.std::locale::facet.base", [4 x i8], %struct.__locale_struct*, i8, [7 x i8], i32*, i32*, i16*, i8, [256 x i8], [256 x i8], i8, [6 x i8] }>

!113 = !DIDerivedType(tag: DW_TAG_member, name: "tinyness_before", scope: !87, file: !25, line: 1732, baseType: !90, flags: DIFlagStaticMember, extraData: i1 false)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "round_style", scope: !87, file: !25, line: 1734, baseType: !115, flags: DIFlagStaticMember, extraData: i32 1)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!116 = !DISubprogram(name: "min", linkageName: "_ZNSt14numeric_limitsIdE3minEv", scope: !87, file: !25, line: 1674, type: !117, scopeLine: 1674, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!117 = !DISubroutineType(types: !118)
!118 = !{!81}
!119 = !DISubprogram(name: "max", linkageName: "_ZNSt14numeric_limitsIdE3maxEv", scope: !87, file: !25, line: 1677, type: !117, scopeLine: 1677, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!120 = !DISubprogram(name: "lowest", linkageName: "_ZNSt14numeric_limitsIdE6lowestEv", scope: !87, file: !25, line: 1681, type: !117, scopeLine: 1681, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!121 = !DISubprogram(name: "epsilon", linkageName: "_ZNSt14numeric_limitsIdE7epsilonEv", scope: !87, file: !25, line: 1696, type: !117, scopeLine: 1696, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!122 = !DISubprogram(name: "round_error", linkageName: "_ZNSt14numeric_limitsIdE11round_errorEv", scope: !87, file: !25, line: 1699, type: !117, scopeLine: 1699, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!123 = !DISubprogram(name: "infinity", linkageName: "_ZNSt14numeric_limitsIdE8infinityEv", scope: !87, file: !25, line: 1715, type: !117, scopeLine: 1715, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!124 = !DISubprogram(name: "quiet_NaN", linkageName: "_ZNSt14numeric_limitsIdE9quiet_NaNEv", scope: !87, file: !25, line: 1718, type: !117, scopeLine: 1718, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!125 = !DISubprogram(name: "signaling_NaN", linkageName: "_ZNSt14numeric_limitsIdE13signaling_NaNEv", scope: !87, file: !25, line: 1721, type: !117, scopeLine: 1721, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!126 = !DISubprogram(name: "denorm_min", linkageName: "_ZNSt14numeric_limitsIdE10denorm_minEv", scope: !87, file: !25, line: 1724, type: !117, scopeLine: 1724, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!127 = !{!128}
!128 = !DITemplateTypeParameter(name: "_Tp", type: !81)
!129 = !{!0, !19}
!130 = !{!131, !150, !153, !158, !218, !226, !230, !237, !241, !245, !247, !249, !253, !262, !266, !272, !278, !280, !284, !288, !292, !296, !307, !309, !313, !317, !321, !323, !328, !332, !336, !338, !340, !344, !365, !369, !373, !377, !379, !385, !387, !393, !398, !402, !406, !410, !414, !418, !420, !422, !426, !430, !434, !436, !440, !444, !446, !448, !452, !458, !463, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !532, !536, !540, !545, !549, !552, !555, !558, !560, !562, !564, !566, !568, !570, !572, !575, !577, !582, !585, !588, !591, !593, !595, !597, !599, !601, !603, !605, !607, !610, !612, !616, !620, !625, !631, !633, !635, !637, !639, !641, !643, !645, !647, !649, !651, !653, !655, !657, !660, !661, !665, !669, !675, !679, !683, !688, !690, !695, !699, !703, !714, !716, !720, !724, !728, !732, !736, !740, !744, !748, !752, !756, !760, !762, !766, !770, !774, !780, !784, !788, !790, !794, !798, !804, !806, !810, !814, !818, !822, !826, !830, !834, !835, !836, !837, !839, !840, !841, !842, !843, !844, !845, !849, !855, !860, !864, !866, !868, !870, !872, !879, !883, !887, !891, !895, !899, !904, !908, !910, !914, !920, !924, !929, !931, !934, !938, !942, !944, !946, !948, !950, !954, !956, !958, !962, !966, !970, !974, !978, !982, !984, !988, !992, !996, !1000, !1002, !1004, !1008, !1012, !1013, !1014, !1015, !1016, !1017, !1023, !1026, !1027, !1029, !1031, !1033, !1035, !1039, !1041, !1043, !1045, !1047, !1049, !1051, !1053, !1055, !1059, !1063, !1065, !1069, !1073, !1079, !1081, !1083, !1087, !1089, !1091, !1093, !1095, !1097, !1099, !1101, !1106, !1110, !1112, !1114, !1119, !1121, !1123, !1125, !1127, !1129, !1131, !1134, !1136, !1138, !1142, !1146, !1148, !1150, !1152, !1154, !1156, !1158, !1160, !1162, !1164, !1166, !1170, !1174, !1176, !1178, !1180, !1182, !1184, !1186, !1188, !1190, !1192, !1194, !1196, !1198, !1200, !1202, !1204, !1208, !1212, !1216, !1218, !1220, !1222, !1224, !1226, !1228, !1230, !1232, !1234, !1238, !1242, !1246, !1248, !1250, !1252, !1256, !1260, !1264, !1266, !1268, !1270, !1272, !1274, !1276, !1278, !1280, !1282, !1284, !1286, !1288, !1292, !1296, !1300, !1302, !1304, !1306, !1308, !1312, !1316, !1318, !1320, !1322, !1324, !1326, !1328, !1332, !1336, !1338, !1340, !1342, !1344, !1348, !1352, !1356, !1358, !1360, !1362, !1364, !1366, !1368, !1372, !1376, !1380, !1382, !1386, !1390, !1392, !1394, !1396, !1398, !1400, !1402, !1407, !1411, !1412, !1417, !1421, !1426, !1431, !1435, !1441, !1445, !1447, !1451, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484}
!131 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !132, file: !149, line: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !133, line: 6, baseType: !134)
!133 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "")
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !135, line: 21, baseType: !136)
!135 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "")
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !135, line: 13, size: 64, flags: DIFlagTypePassByValue, elements: !137, identifier: "_ZTS11__mbstate_t")
!137 = !{!138, !139}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !136, file: !135, line: 15, baseType: !11, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !136, file: !135, line: 20, baseType: !140, size: 32, offset: 32)
!140 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !136, file: !135, line: 16, size: 32, flags: DIFlagTypePassByValue, elements: !141, identifier: "_ZTSN11__mbstate_tUt_E")
!141 = !{!142, !144}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !140, file: !135, line: 18, baseType: !143, size: 32)
!143 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !140, file: !135, line: 19, baseType: !145, size: 32)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 32, elements: !147)
!146 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!147 = !{!148}
!148 = !DISubrange(count: 4)
!149 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/cwchar", directory: "")
!150 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !151, file: !149, line: 139)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !152, line: 20, baseType: !143)
!152 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/wint_t.h", directory: "")
!153 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !154, file: !149, line: 141)
!154 = !DISubprogram(name: "btowc", scope: !155, file: !155, line: 318, type: !156, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!155 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!156 = !DISubroutineType(types: !157)
!157 = !{!151, !11}
!158 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !159, file: !149, line: 142)
!159 = !DISubprogram(name: "fgetwc", scope: !155, file: !155, line: 727, type: !160, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!160 = !DISubroutineType(types: !161)
!161 = !{!151, !162}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !164, line: 5, baseType: !165)
!164 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__FILE.h", directory: "")
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !166, line: 245, size: 1728, flags: DIFlagTypePassByValue, elements: !167, identifier: "_ZTS8_IO_FILE")
!166 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "")
!167 = !{!168, !169, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !184, !186, !187, !188, !191, !193, !195, !199, !202, !204, !206, !207, !208, !209, !213, !214}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !165, file: !166, line: 246, baseType: !11, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !165, file: !166, line: 251, baseType: !170, size: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !165, file: !166, line: 252, baseType: !170, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !165, file: !166, line: 253, baseType: !170, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !165, file: !166, line: 254, baseType: !170, size: 64, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !165, file: !166, line: 255, baseType: !170, size: 64, offset: 320)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !165, file: !166, line: 256, baseType: !170, size: 64, offset: 384)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !165, file: !166, line: 257, baseType: !170, size: 64, offset: 448)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !165, file: !166, line: 258, baseType: !170, size: 64, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !165, file: !166, line: 260, baseType: !170, size: 64, offset: 576)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !165, file: !166, line: 261, baseType: !170, size: 64, offset: 640)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !165, file: !166, line: 262, baseType: !170, size: 64, offset: 704)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !165, file: !166, line: 264, baseType: !182, size: 64, offset: 768)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !166, line: 160, flags: DIFlagFwdDecl, identifier: "_ZTS10_IO_marker")
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !165, file: !166, line: 266, baseType: !185, size: 64, offset: 832)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !165, file: !166, line: 268, baseType: !11, size: 32, offset: 896)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !165, file: !166, line: 272, baseType: !11, size: 32, offset: 928)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !165, file: !166, line: 274, baseType: !189, size: 64, offset: 960)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !190, line: 140, baseType: !86)
!190 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !165, file: !166, line: 278, baseType: !192, size: 16, offset: 1024)
!192 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !165, file: !166, line: 279, baseType: !194, size: 8, offset: 1040)
!194 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !165, file: !166, line: 280, baseType: !196, size: 8, offset: 1048)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 8, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 1)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !165, file: !166, line: 284, baseType: !200, size: 64, offset: 1088)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !166, line: 154, baseType: null)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !165, file: !166, line: 293, baseType: !203, size: 64, offset: 1152)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !190, line: 141, baseType: !86)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !165, file: !166, line: 301, baseType: !205, size: 64, offset: 1216)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !165, file: !166, line: 302, baseType: !205, size: 64, offset: 1280)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !165, file: !166, line: 303, baseType: !205, size: 64, offset: 1344)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !165, file: !166, line: 304, baseType: !205, size: 64, offset: 1408)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !165, file: !166, line: 306, baseType: !210, size: 64, offset: 1472)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !211, line: 46, baseType: !212)
!211 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!212 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !165, file: !166, line: 307, baseType: !11, size: 32, offset: 1536)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !165, file: !166, line: 309, baseType: !215, size: 160, offset: 1568)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 160, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 20)
!218 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !219, file: !149, line: 143)
!219 = !DISubprogram(name: "fgetws", scope: !155, file: !155, line: 756, type: !220, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!220 = !DISubroutineType(types: !221)
!221 = !{!222, !224, !11, !225}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!224 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !222)
!225 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !162)
!226 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !227, file: !149, line: 144)
!227 = !DISubprogram(name: "fputwc", scope: !155, file: !155, line: 741, type: !228, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!228 = !DISubroutineType(types: !229)
!229 = !{!151, !223, !162}
!230 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !231, file: !149, line: 145)
!231 = !DISubprogram(name: "fputws", scope: !155, file: !155, line: 763, type: !232, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!232 = !DISubroutineType(types: !233)
!233 = !{!11, !234, !225}
!234 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !223)
!237 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !238, file: !149, line: 146)
!238 = !DISubprogram(name: "fwide", scope: !155, file: !155, line: 573, type: !239, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!239 = !DISubroutineType(types: !240)
!240 = !{!11, !162, !11}
!241 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !242, file: !149, line: 147)
!242 = !DISubprogram(name: "fwprintf", scope: !155, file: !155, line: 580, type: !243, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!243 = !DISubroutineType(types: !244)
!244 = !{!11, !225, !234, null}
!245 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !246, file: !149, line: 148)
!246 = !DISubprogram(name: "fwscanf", scope: !155, file: !155, line: 621, type: !243, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!247 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !248, file: !149, line: 149)
!248 = !DISubprogram(name: "getwc", scope: !155, file: !155, line: 728, type: !160, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!249 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !250, file: !149, line: 150)
!250 = !DISubprogram(name: "getwchar", scope: !155, file: !155, line: 734, type: !251, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!251 = !DISubroutineType(types: !252)
!252 = !{!151}
!253 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !254, file: !149, line: 151)
!254 = !DISubprogram(name: "mbrlen", scope: !155, file: !155, line: 329, type: !255, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!255 = !DISubroutineType(types: !256)
!256 = !{!210, !257, !210, !260}
!257 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!260 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!262 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !263, file: !149, line: 152)
!263 = !DISubprogram(name: "mbrtowc", scope: !155, file: !155, line: 296, type: !264, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!264 = !DISubroutineType(types: !265)
!265 = !{!210, !224, !257, !210, !260}
!266 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !267, file: !149, line: 153)
!267 = !DISubprogram(name: "mbsinit", scope: !155, file: !155, line: 292, type: !268, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!268 = !DISubroutineType(types: !269)
!269 = !{!11, !270}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!272 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !273, file: !149, line: 154)
!273 = !DISubprogram(name: "mbsrtowcs", scope: !155, file: !155, line: 337, type: !274, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!274 = !DISubroutineType(types: !275)
!275 = !{!210, !224, !276, !210, !260}
!276 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!278 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !279, file: !149, line: 155)
!279 = !DISubprogram(name: "putwc", scope: !155, file: !155, line: 742, type: !228, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!280 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !281, file: !149, line: 156)
!281 = !DISubprogram(name: "putwchar", scope: !155, file: !155, line: 748, type: !282, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!282 = !DISubroutineType(types: !283)
!283 = !{!151, !223}
!284 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !285, file: !149, line: 158)
!285 = !DISubprogram(name: "swprintf", scope: !155, file: !155, line: 590, type: !286, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!286 = !DISubroutineType(types: !287)
!287 = !{!11, !224, !210, !234, null}
!288 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !289, file: !149, line: 160)
!289 = !DISubprogram(name: "swscanf", scope: !155, file: !155, line: 631, type: !290, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!290 = !DISubroutineType(types: !291)
!291 = !{!11, !234, !234, null}
!292 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !293, file: !149, line: 161)
!293 = !DISubprogram(name: "ungetwc", scope: !155, file: !155, line: 771, type: !294, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!294 = !DISubroutineType(types: !295)
!295 = !{!151, !151, !162}
!296 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !297, file: !149, line: 162)
!297 = !DISubprogram(name: "vfwprintf", scope: !155, file: !155, line: 598, type: !298, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!298 = !DISubroutineType(types: !299)
!299 = !{!11, !225, !234, !300}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !22, size: 192, flags: DIFlagTypePassByValue, elements: !302, identifier: "_ZTS13__va_list_tag")
!302 = !{!303, !304, !305, !306}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !301, file: !22, baseType: !143, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !301, file: !22, baseType: !143, size: 32, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !301, file: !22, baseType: !205, size: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !301, file: !22, baseType: !205, size: 64, offset: 128)
!307 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !308, file: !149, line: 164)
!308 = !DISubprogram(name: "vfwscanf", scope: !155, file: !155, line: 673, type: !298, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!309 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !310, file: !149, line: 167)
!310 = !DISubprogram(name: "vswprintf", scope: !155, file: !155, line: 611, type: !311, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!311 = !DISubroutineType(types: !312)
!312 = !{!11, !224, !210, !234, !300}
!313 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !314, file: !149, line: 170)
!314 = !DISubprogram(name: "vswscanf", scope: !155, file: !155, line: 685, type: !315, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!315 = !DISubroutineType(types: !316)
!316 = !{!11, !234, !234, !300}
!317 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !318, file: !149, line: 172)
!318 = !DISubprogram(name: "vwprintf", scope: !155, file: !155, line: 606, type: !319, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!319 = !DISubroutineType(types: !320)
!320 = !{!11, !234, !300}
!321 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !322, file: !149, line: 174)
!322 = !DISubprogram(name: "vwscanf", scope: !155, file: !155, line: 681, type: !319, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!323 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !324, file: !149, line: 176)
!324 = !DISubprogram(name: "wcrtomb", scope: !155, file: !155, line: 301, type: !325, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!325 = !DISubroutineType(types: !326)
!326 = !{!210, !327, !223, !260}
!327 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !170)
!328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !329, file: !149, line: 177)
!329 = !DISubprogram(name: "wcscat", scope: !155, file: !155, line: 97, type: !330, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!330 = !DISubroutineType(types: !331)
!331 = !{!222, !224, !234}
!332 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !333, file: !149, line: 178)
!333 = !DISubprogram(name: "wcscmp", scope: !155, file: !155, line: 106, type: !334, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!334 = !DISubroutineType(types: !335)
!335 = !{!11, !235, !235}
!336 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !337, file: !149, line: 179)
!337 = !DISubprogram(name: "wcscoll", scope: !155, file: !155, line: 131, type: !334, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!338 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !339, file: !149, line: 180)
!339 = !DISubprogram(name: "wcscpy", scope: !155, file: !155, line: 87, type: !330, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!340 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !341, file: !149, line: 181)
!341 = !DISubprogram(name: "wcscspn", scope: !155, file: !155, line: 187, type: !342, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!342 = !DISubroutineType(types: !343)
!343 = !{!210, !235, !235}
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !345, file: !149, line: 182)
!345 = !DISubprogram(name: "wcsftime", scope: !155, file: !155, line: 835, type: !346, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!346 = !DISubroutineType(types: !347)
!347 = !{!210, !224, !210, !234, !348}
!348 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !351)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !352, line: 7, size: 448, flags: DIFlagTypePassByValue, elements: !353, identifier: "_ZTS2tm")
!352 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "")
!353 = !{!354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !351, file: !352, line: 9, baseType: !11, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !351, file: !352, line: 10, baseType: !11, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !351, file: !352, line: 11, baseType: !11, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !351, file: !352, line: 12, baseType: !11, size: 32, offset: 96)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !351, file: !352, line: 13, baseType: !11, size: 32, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !351, file: !352, line: 14, baseType: !11, size: 32, offset: 160)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !351, file: !352, line: 15, baseType: !11, size: 32, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !351, file: !352, line: 16, baseType: !11, size: 32, offset: 224)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !351, file: !352, line: 17, baseType: !11, size: 32, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !351, file: !352, line: 20, baseType: !86, size: 64, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !351, file: !352, line: 21, baseType: !258, size: 64, offset: 384)
!365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !366, file: !149, line: 183)
!366 = !DISubprogram(name: "wcslen", scope: !155, file: !155, line: 222, type: !367, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!367 = !DISubroutineType(types: !368)
!368 = !{!210, !235}
!369 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !370, file: !149, line: 184)
!370 = !DISubprogram(name: "wcsncat", scope: !155, file: !155, line: 101, type: !371, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!371 = !DISubroutineType(types: !372)
!372 = !{!222, !224, !234, !210}
!373 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !374, file: !149, line: 185)
!374 = !DISubprogram(name: "wcsncmp", scope: !155, file: !155, line: 109, type: !375, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!375 = !DISubroutineType(types: !376)
!376 = !{!11, !235, !235, !210}
!377 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !378, file: !149, line: 186)
!378 = !DISubprogram(name: "wcsncpy", scope: !155, file: !155, line: 92, type: !371, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!379 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !380, file: !149, line: 187)
!380 = !DISubprogram(name: "wcsrtombs", scope: !155, file: !155, line: 343, type: !381, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!381 = !DISubroutineType(types: !382)
!382 = !{!210, !327, !383, !210, !260}
!383 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !386, file: !149, line: 188)
!386 = !DISubprogram(name: "wcsspn", scope: !155, file: !155, line: 191, type: !342, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!387 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !388, file: !149, line: 189)
!388 = !DISubprogram(name: "wcstod", scope: !155, file: !155, line: 377, type: !389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!389 = !DISubroutineType(types: !390)
!390 = !{!81, !234, !391}
!391 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!393 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !394, file: !149, line: 191)
!394 = !DISubprogram(name: "wcstof", scope: !155, file: !155, line: 382, type: !395, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!395 = !DISubroutineType(types: !396)
!396 = !{!397, !234, !391}
!397 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!398 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !399, file: !149, line: 193)
!399 = !DISubprogram(name: "wcstok", scope: !155, file: !155, line: 217, type: !400, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!400 = !DISubroutineType(types: !401)
!401 = !{!222, !224, !234, !391}
!402 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !403, file: !149, line: 194)
!403 = !DISubprogram(name: "wcstol", scope: !155, file: !155, line: 428, type: !404, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!404 = !DISubroutineType(types: !405)
!405 = !{!86, !234, !391, !11}
!406 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !407, file: !149, line: 195)
!407 = !DISubprogram(name: "wcstoul", scope: !155, file: !155, line: 433, type: !408, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!408 = !DISubroutineType(types: !409)
!409 = !{!212, !234, !391, !11}
!410 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !411, file: !149, line: 196)
!411 = !DISubprogram(name: "wcsxfrm", scope: !155, file: !155, line: 135, type: !412, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!412 = !DISubroutineType(types: !413)
!413 = !{!210, !224, !234, !210}
!414 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !415, file: !149, line: 197)
!415 = !DISubprogram(name: "wctob", scope: !155, file: !155, line: 324, type: !416, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!416 = !DISubroutineType(types: !417)
!417 = !{!11, !151}
!418 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !419, file: !149, line: 198)
!419 = !DISubprogram(name: "wmemcmp", scope: !155, file: !155, line: 258, type: !375, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !421, file: !149, line: 199)
!421 = !DISubprogram(name: "wmemcpy", scope: !155, file: !155, line: 262, type: !371, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !423, file: !149, line: 200)
!423 = !DISubprogram(name: "wmemmove", scope: !155, file: !155, line: 267, type: !424, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!424 = !DISubroutineType(types: !425)
!425 = !{!222, !222, !235, !210}
!426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !427, file: !149, line: 201)
!427 = !DISubprogram(name: "wmemset", scope: !155, file: !155, line: 271, type: !428, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!428 = !DISubroutineType(types: !429)
!429 = !{!222, !222, !223, !210}
!430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !431, file: !149, line: 202)
!431 = !DISubprogram(name: "wprintf", scope: !155, file: !155, line: 587, type: !432, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!432 = !DISubroutineType(types: !433)
!433 = !{!11, !234, null}
!434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !435, file: !149, line: 203)
!435 = !DISubprogram(name: "wscanf", scope: !155, file: !155, line: 628, type: !432, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!436 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !437, file: !149, line: 204)
!437 = !DISubprogram(name: "wcschr", scope: !155, file: !155, line: 164, type: !438, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!438 = !DISubroutineType(types: !439)
!439 = !{!222, !235, !223}
!440 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !441, file: !149, line: 205)
!441 = !DISubprogram(name: "wcspbrk", scope: !155, file: !155, line: 201, type: !442, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!442 = !DISubroutineType(types: !443)
!443 = !{!222, !235, !235}
!444 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !445, file: !149, line: 206)
!445 = !DISubprogram(name: "wcsrchr", scope: !155, file: !155, line: 174, type: !438, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!446 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !447, file: !149, line: 207)
!447 = !DISubprogram(name: "wcsstr", scope: !155, file: !155, line: 212, type: !442, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!448 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !449, file: !149, line: 208)
!449 = !DISubprogram(name: "wmemchr", scope: !155, file: !155, line: 253, type: !450, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!450 = !DISubroutineType(types: !451)
!451 = !{!222, !235, !223, !210}
!452 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !453, entity: !454, file: !149, line: 248)
!453 = !DINamespace(name: "__gnu_cxx", scope: null)
!454 = !DISubprogram(name: "wcstold", scope: !155, file: !155, line: 384, type: !455, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!455 = !DISubroutineType(types: !456)
!456 = !{!457, !234, !391}
!457 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !453, entity: !459, file: !149, line: 257)
!459 = !DISubprogram(name: "wcstoll", scope: !155, file: !155, line: 441, type: !460, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!460 = !DISubroutineType(types: !461)
!461 = !{!462, !234, !391, !11}
!462 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !453, entity: !464, file: !149, line: 258)
!464 = !DISubprogram(name: "wcstoull", scope: !155, file: !155, line: 448, type: !465, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!465 = !DISubroutineType(types: !466)
!466 = !{!467, !234, !391, !11}
!467 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !454, file: !149, line: 264)
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !459, file: !149, line: 265)
!470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !464, file: !149, line: 266)
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !394, file: !149, line: 280)
!472 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !308, file: !149, line: 283)
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !314, file: !149, line: 286)
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !322, file: !149, line: 289)
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !454, file: !149, line: 293)
!476 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !459, file: !149, line: 294)
!477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !464, file: !149, line: 295)
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !479, file: !480, line: 57)
!479 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "exception_ptr", scope: !481, file: !480, line: 79, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !482, identifier: "_ZTSNSt15__exception_ptr13exception_ptrE")
!480 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/bits/exception_ptr.h", directory: "")
!481 = !DINamespace(name: "__exception_ptr", scope: !2)
!482 = !{!483, !484, !488, !491, !492, !497, !498, !502, !507, !511, !515, !518, !519, !522, !525}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "_M_exception_object", scope: !479, file: !480, line: 81, baseType: !205, size: 64)
!484 = !DISubprogram(name: "exception_ptr", scope: !479, file: !480, line: 83, type: !485, scopeLine: 83, flags: DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !487, !205}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!488 = !DISubprogram(name: "_M_addref", linkageName: "_ZNSt15__exception_ptr13exception_ptr9_M_addrefEv", scope: !479, file: !480, line: 85, type: !489, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !487}
!491 = !DISubprogram(name: "_M_release", linkageName: "_ZNSt15__exception_ptr13exception_ptr10_M_releaseEv", scope: !479, file: !480, line: 86, type: !489, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!492 = !DISubprogram(name: "_M_get", linkageName: "_ZNKSt15__exception_ptr13exception_ptr6_M_getEv", scope: !479, file: !480, line: 88, type: !493, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!493 = !DISubroutineType(types: !494)
!494 = !{!205, !495}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !479)
!497 = !DISubprogram(name: "exception_ptr", scope: !479, file: !480, line: 96, type: !489, scopeLine: 96, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!498 = !DISubprogram(name: "exception_ptr", scope: !479, file: !480, line: 98, type: !499, scopeLine: 98, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !487, !501}
!501 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !496, size: 64)
!502 = !DISubprogram(name: "exception_ptr", scope: !479, file: !480, line: 101, type: !503, scopeLine: 101, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!503 = !DISubroutineType(types: !504)
!504 = !{null, !487, !505}
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "nullptr_t", scope: !2, file: !85, line: 235, baseType: !506)
!506 = !DIBasicType(tag: DW_TAG_unspecified_type, name: "decltype(nullptr)")
!507 = !DISubprogram(name: "exception_ptr", scope: !479, file: !480, line: 105, type: !508, scopeLine: 105, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !487, !510}
!510 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !479, size: 64)
!511 = !DISubprogram(name: "operator=", linkageName: "_ZNSt15__exception_ptr13exception_ptraSERKS0_", scope: !479, file: !480, line: 118, type: !512, scopeLine: 118, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!512 = !DISubroutineType(types: !513)
!513 = !{!514, !487, !501}
!514 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !479, size: 64)
!515 = !DISubprogram(name: "operator=", linkageName: "_ZNSt15__exception_ptr13exception_ptraSEOS0_", scope: !479, file: !480, line: 122, type: !516, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!516 = !DISubroutineType(types: !517)
!517 = !{!514, !487, !510}
!518 = !DISubprogram(name: "~exception_ptr", scope: !479, file: !480, line: 129, type: !489, scopeLine: 129, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!519 = !DISubprogram(name: "swap", linkageName: "_ZNSt15__exception_ptr13exception_ptr4swapERS0_", scope: !479, file: !480, line: 132, type: !520, scopeLine: 132, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !487, !514}
!522 = !DISubprogram(name: "operator bool", linkageName: "_ZNKSt15__exception_ptr13exception_ptrcvbEv", scope: !479, file: !480, line: 144, type: !523, scopeLine: 144, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!523 = !DISubroutineType(types: !524)
!524 = !{!13, !495}
!525 = !DISubprogram(name: "__cxa_exception_type", linkageName: "_ZNKSt15__exception_ptr13exception_ptr20__cxa_exception_typeEv", scope: !479, file: !480, line: 153, type: !526, scopeLine: 153, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!526 = !DISubroutineType(types: !527)
!527 = !{!528, !495}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !530)
!530 = !DICompositeType(tag: DW_TAG_class_type, name: "type_info", scope: !2, file: !531, line: 88, flags: DIFlagFwdDecl, identifier: "_ZTSSt9type_info")
!531 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/typeinfo", directory: "")
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !481, entity: !533, file: !480, line: 73)
!533 = !DISubprogram(name: "rethrow_exception", linkageName: "_ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE", scope: !2, file: !480, line: 69, type: !534, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !479}
!536 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !537, entity: !538, file: !539, line: 58)
!537 = !DINamespace(name: "__gnu_debug", scope: null)
!538 = !DINamespace(name: "__debug", scope: !2)
!539 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/debug/debug.h", directory: "")
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !541, file: !544, line: 48)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !542, line: 24, baseType: !543)
!542 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !190, line: 36, baseType: !194)
!544 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/cstdint", directory: "")
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !546, file: !544, line: 49)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !542, line: 25, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !190, line: 38, baseType: !548)
!548 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !550, file: !544, line: 50)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !542, line: 26, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !190, line: 40, baseType: !11)
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !553, file: !544, line: 51)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !542, line: 27, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !190, line: 43, baseType: !86)
!555 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !556, file: !544, line: 53)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !557, line: 68, baseType: !194)
!557 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!558 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !559, file: !544, line: 54)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !557, line: 70, baseType: !86)
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !561, file: !544, line: 55)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !557, line: 71, baseType: !86)
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !563, file: !544, line: 56)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !557, line: 72, baseType: !86)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !565, file: !544, line: 58)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !557, line: 43, baseType: !194)
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !567, file: !544, line: 59)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !557, line: 44, baseType: !548)
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !569, file: !544, line: 60)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !557, line: 45, baseType: !11)
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !571, file: !544, line: 61)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !557, line: 47, baseType: !86)
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !573, file: !544, line: 63)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !557, line: 111, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !190, line: 61, baseType: !86)
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !576, file: !544, line: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !557, line: 97, baseType: !86)
!577 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !578, file: !544, line: 66)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !579, line: 24, baseType: !580)
!579 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !190, line: 37, baseType: !581)
!581 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!582 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !583, file: !544, line: 67)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !579, line: 25, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !190, line: 39, baseType: !192)
!585 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !586, file: !544, line: 68)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !579, line: 26, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !190, line: 41, baseType: !143)
!588 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !589, file: !544, line: 69)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !579, line: 27, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !190, line: 44, baseType: !212)
!591 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !592, file: !544, line: 71)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !557, line: 81, baseType: !581)
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !594, file: !544, line: 72)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !557, line: 83, baseType: !212)
!595 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !596, file: !544, line: 73)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !557, line: 84, baseType: !212)
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !598, file: !544, line: 74)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !557, line: 85, baseType: !212)
!599 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !600, file: !544, line: 76)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !557, line: 54, baseType: !581)
!601 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !602, file: !544, line: 77)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !557, line: 55, baseType: !192)
!603 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !604, file: !544, line: 78)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !557, line: 56, baseType: !143)
!605 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !606, file: !544, line: 79)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !557, line: 58, baseType: !212)
!607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !608, file: !544, line: 81)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !557, line: 112, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !190, line: 62, baseType: !212)
!610 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !611, file: !544, line: 82)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !557, line: 100, baseType: !212)
!612 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !613, file: !615, line: 53)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !614, line: 51, flags: DIFlagFwdDecl, identifier: "_ZTS5lconv")
!614 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!615 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/clocale", directory: "")
!616 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !617, file: !615, line: 54)
!617 = !DISubprogram(name: "setlocale", scope: !614, file: !614, line: 122, type: !618, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!618 = !DISubroutineType(types: !619)
!619 = !{!170, !11, !258}
!620 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !621, file: !615, line: 55)
!621 = !DISubprogram(name: "localeconv", scope: !614, file: !614, line: 125, type: !622, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!622 = !DISubroutineType(types: !623)
!623 = !{!624}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !626, file: !630, line: 64)
!626 = !DISubprogram(name: "isalnum", scope: !627, file: !627, line: 108, type: !628, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!627 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!628 = !DISubroutineType(types: !629)
!629 = !{!11, !11}
!630 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/cctype", directory: "")
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !632, file: !630, line: 65)
!632 = !DISubprogram(name: "isalpha", scope: !627, file: !627, line: 109, type: !628, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !634, file: !630, line: 66)
!634 = !DISubprogram(name: "iscntrl", scope: !627, file: !627, line: 110, type: !628, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!635 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !636, file: !630, line: 67)
!636 = !DISubprogram(name: "isdigit", scope: !627, file: !627, line: 111, type: !628, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !638, file: !630, line: 68)
!638 = !DISubprogram(name: "isgraph", scope: !627, file: !627, line: 113, type: !628, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !640, file: !630, line: 69)
!640 = !DISubprogram(name: "islower", scope: !627, file: !627, line: 112, type: !628, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !642, file: !630, line: 70)
!642 = !DISubprogram(name: "isprint", scope: !627, file: !627, line: 114, type: !628, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !644, file: !630, line: 71)
!644 = !DISubprogram(name: "ispunct", scope: !627, file: !627, line: 115, type: !628, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!645 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !646, file: !630, line: 72)
!646 = !DISubprogram(name: "isspace", scope: !627, file: !627, line: 116, type: !628, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!647 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !648, file: !630, line: 73)
!648 = !DISubprogram(name: "isupper", scope: !627, file: !627, line: 117, type: !628, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!649 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !650, file: !630, line: 74)
!650 = !DISubprogram(name: "isxdigit", scope: !627, file: !627, line: 118, type: !628, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !652, file: !630, line: 75)
!652 = !DISubprogram(name: "tolower", scope: !627, file: !627, line: 122, type: !628, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!653 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !654, file: !630, line: 76)
!654 = !DISubprogram(name: "toupper", scope: !627, file: !627, line: 125, type: !628, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !656, file: !630, line: 87)
!656 = !DISubprogram(name: "isblank", scope: !627, file: !627, line: 130, type: !628, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !453, entity: !658, file: !659, line: 44)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", scope: !2, file: !85, line: 231, baseType: !212)
!659 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/ext/new_allocator.h", directory: "")
!660 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !453, entity: !84, file: !659, line: 45)
!661 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !662, file: !664, line: 52)
!662 = !DISubprogram(name: "abs", scope: !663, file: !663, line: 837, type: !628, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!663 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!664 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/bits/std_abs.h", directory: "")
!665 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !666, file: !668, line: 127)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !663, line: 62, baseType: !667)
!667 = !DICompositeType(tag: DW_TAG_structure_type, file: !663, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!668 = !DIFile(filename: "/usr/bin/../lib/gcc/x86_64-linux-gnu/7.5.0/../../../../include/c++/7.5.0/cstdlib", directory: "")
!669 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !670, file: !668, line: 128)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !663, line: 70, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !663, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !672, identifier: "_ZTS6ldiv_t")
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !671, file: !663, line: 68, baseType: !86, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !671, file: !663, line: 69, baseType: !86, size: 64, offset: 64)
!675 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !676, file: !668, line: 130)
!676 = !DISubprogram(name: "abort", scope: !663, file: !663, line: 588, type: !677, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!677 = !DISubroutineType(types: !678)
!678 = !{null}
!679 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !680, file: !668, line: 132)
!680 = !DISubprogram(name: "aligned_alloc", scope: !663, file: !663, line: 583, type: !681, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!681 = !DISubroutineType(types: !682)
!682 = !{!205, !210, !210}
!683 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !684, file: !668, line: 134)
!684 = !DISubprogram(name: "atexit", scope: !663, file: !663, line: 592, type: !685, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!685 = !DISubroutineType(types: !686)
!686 = !{!11, !687}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!688 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !689, file: !668, line: 137)
!689 = !DISubprogram(name: "at_quick_exit", scope: !663, file: !663, line: 597, type: !685, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!690 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !691, file: !668, line: 140)
!691 = !DISubprogram(name: "atof", scope: !692, file: !692, line: 25, type: !693, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!692 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!693 = !DISubroutineType(types: !694)
!694 = !{!81, !258}
!695 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !696, file: !668, line: 141)
!696 = !DISubprogram(name: "atoi", scope: !663, file: !663, line: 361, type: !697, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!697 = !DISubroutineType(types: !698)
!698 = !{!11, !258}
!699 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !700, file: !668, line: 142)
!700 = !DISubprogram(name: "atol", scope: !663, file: !663, line: 366, type: !701, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!701 = !DISubroutineType(types: !702)
!702 = !{!86, !258}
!703 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !704, file: !668, line: 143)
!704 = !DISubprogram(name: "bsearch", scope: !705, file: !705, line: 20, type: !706, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!705 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!706 = !DISubroutineType(types: !707)
!707 = !{!205, !708, !708, !210, !210, !710}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !663, line: 805, baseType: !711)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!11, !708, !708}
!714 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !715, file: !668, line: 144)
!715 = !DISubprogram(name: "calloc", scope: !663, file: !663, line: 541, type: !681, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!716 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !717, file: !668, line: 145)
!717 = !DISubprogram(name: "div", scope: !663, file: !663, line: 849, type: !718, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!718 = !DISubroutineType(types: !719)
!719 = !{!666, !11, !11}
!720 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !721, file: !668, line: 146)
!721 = !DISubprogram(name: "exit", scope: !663, file: !663, line: 614, type: !722, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!722 = !DISubroutineType(types: !723)
!723 = !{null, !11}
!724 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !725, file: !668, line: 147)
!725 = !DISubprogram(name: "free", scope: !663, file: !663, line: 563, type: !726, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!726 = !DISubroutineType(types: !727)
!727 = !{null, !205}
!728 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !729, file: !668, line: 148)
!729 = !DISubprogram(name: "getenv", scope: !663, file: !663, line: 631, type: !730, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!730 = !DISubroutineType(types: !731)
!731 = !{!170, !258}
!732 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !733, file: !668, line: 149)
!733 = !DISubprogram(name: "labs", scope: !663, file: !663, line: 838, type: !734, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!734 = !DISubroutineType(types: !735)
!735 = !{!86, !86}
!736 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !737, file: !668, line: 150)
!737 = !DISubprogram(name: "ldiv", scope: !663, file: !663, line: 851, type: !738, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!738 = !DISubroutineType(types: !739)
!739 = !{!670, !86, !86}
!740 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !741, file: !668, line: 151)
!741 = !DISubprogram(name: "malloc", scope: !663, file: !663, line: 539, type: !742, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!742 = !DISubroutineType(types: !743)
!743 = !{!205, !210}
!744 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !745, file: !668, line: 153)
!745 = !DISubprogram(name: "mblen", scope: !663, file: !663, line: 919, type: !746, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!746 = !DISubroutineType(types: !747)
!747 = !{!11, !258, !210}
!748 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !749, file: !668, line: 154)
!749 = !DISubprogram(name: "mbstowcs", scope: !663, file: !663, line: 930, type: !750, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!750 = !DISubroutineType(types: !751)
!751 = !{!210, !224, !257, !210}
!752 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !753, file: !668, line: 155)
!753 = !DISubprogram(name: "mbtowc", scope: !663, file: !663, line: 922, type: !754, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!754 = !DISubroutineType(types: !755)
!755 = !{!11, !224, !257, !210}
!756 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !757, file: !668, line: 157)
!757 = !DISubprogram(name: "qsort", scope: !663, file: !663, line: 827, type: !758, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !205, !210, !210, !710}
!760 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !761, file: !668, line: 160)
!761 = !DISubprogram(name: "quick_exit", scope: !663, file: !663, line: 620, type: !722, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!762 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !763, file: !668, line: 163)
!763 = !DISubprogram(name: "rand", scope: !663, file: !663, line: 453, type: !764, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!764 = !DISubroutineType(types: !765)
!765 = !{!11}
!766 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !767, file: !668, line: 164)
!767 = !DISubprogram(name: "realloc", scope: !663, file: !663, line: 549, type: !768, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!768 = !DISubroutineType(types: !769)
!769 = !{!205, !205, !210}
!770 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !771, file: !668, line: 165)
!771 = !DISubprogram(name: "srand", scope: !663, file: !663, line: 455, type: !772, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!772 = !DISubroutineType(types: !773)
!773 = !{null, !143}
!774 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !775, file: !668, line: 166)
!775 = !DISubprogram(name: "strtod", scope: !663, file: !663, line: 117, type: !776, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!776 = !DISubroutineType(types: !777)
!777 = !{!81, !257, !778}
!778 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !779)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!780 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !781, file: !668, line: 167)
!781 = !DISubprogram(name: "strtol", scope: !663, file: !663, line: 176, type: !782, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!782 = !DISubroutineType(types: !783)
!783 = !{!86, !257, !778, !11}
!784 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !785, file: !668, line: 168)
!785 = !DISubprogram(name: "strtoul", scope: !663, file: !663, line: 180, type: !786, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!786 = !DISubroutineType(types: !787)
!787 = !{!212, !257, !778, !11}
!788 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !789, file: !668, line: 169)
!789 = !DISubprogram(name: "system", scope: !663, file: !663, line: 781, type: !697, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!790 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !791, file: !668, line: 171)
!791 = !DISubprogram(name: "wcstombs", scope: !663, file: !663, line: 933, type: !792, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!792 = !DISubroutineType(types: !793)
!793 = !{!210, !327, !234, !210}
!794 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !795, file: !668, line: 172)
!795 = !DISubprogram(name: "wctomb", scope: !663, file: !663, line: 926, type: !796, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!796 = !DISubroutineType(types: !797)
!797 = !{!11, !170, !223}
!798 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !453, entity: !799, file: !668, line: 200)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !663, line: 80, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !663, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !801, identifier: "_ZTS7lldiv_t")
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !800, file: !663, line: 78, baseType: !462, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !800, file: !663, line: 79, baseType: !462, size: 64, offset: 64)
!804 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !453, entity: !805, file: !668, line: 206)
!805 = !DISubprogram(name: "_Exit", scope: !663, file: !663, line: 626, type: !722, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!806 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !453, entity: !807, file: !668, line: 210)
!807 = !DISubprogram(name: "llabs", scope: !663, file: !663, line: 841, type: !808, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!808 = !DISubroutineType(types: !809)
!809 = !{!462, !462}
!810 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !453, entity: !811, file: !668, line: 216)
!811 = !DISubprogram(name: "lldiv", scope: !663, file: !663, line: 855, type: !812, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!812 = !DISubroutineType(types: !813)
!813 = !{!799, !462, !462}
!814 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !453, entity: !815, file: !668, line: 227)
!815 = !DISubprogram(name: "atoll", scope: !663, file: !663, line: 373, type: !816, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!816 = !DISubroutineType(types: !817)
!817 = !{!462, !258}
!818 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !453, entity: !819, file: !668, line: 228)
!819 = !DISubprogram(name: "strtoll", scope: !663, file: !663, line: 200, type: !820, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!820 = !DISubroutineType(types: !821)
!821 = !{!462, !257, !778, !11}
!822 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !453, entity: !823, file: !668, line: 229)
!823 = !DISubprogram(name: "strtoull", scope: !663, file: !663, line: 205, type: !824, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!824 = !DISubroutineType(types: !825)
!825 = !{!467, !257, !778, !11}
!826 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !453, entity: !827, file: !668, line: 231)
!827 = !DISubprogram(name: "strtof", scope: !663, file: !663, line: 123, type: !828, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!828 = !DISubroutineType(types: !829)
!829 = !{!397, !257, !778}
!830 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !453, entity: !831, file: !668, line: 232)
!831 = !DISubprogram(name: "strtold", scope: !663, file: !663, line: 126, type: !832, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!832 = !DISubroutineType(types: !833)
!833 = !{!457, !257, !778}
!834 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !799, file: !668, line: 240)
!835 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !805, file: !668, line: 242)
!836 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !807, file: !668, line: 244)
!837 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !838, file: !668, line: 245)
!838 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !453, file: !668, line: 213, type: !812, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!839 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !811, file: !668, line: 246)
!840 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !815, file: !668, line: 248)
!841 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !827, file: !668, line: 249)
!842 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !819, file: !668, line: 250)
!843 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !823, file: !668, line: 251)
!844 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !831, file: !668, line: 252)
!845 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !846, file: !848, line: 98)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !847, line: 7, baseType: !165)
